In [41]:
import pandas as pd
import numpy as np
import os
df = pd.read_csv('purchase_data.csv')
input = open('e1_input.txt').read()
prod1, prod2 = input.split()

In [42]:
df.head(5)

   timestamp  memberID  productID  productScore
0  827500641       215         10             2
1  827500641       215         11             4
2  827500641       215         16             3
3  827500641       215         21             4
4  827500641       215         40             3

In [43]:
members = list(df['memberID'].unique())

In [55]:

all_members = []
for x in members:
    test = df[df['memberID'] == x]
    if int(prod1) in test['productID'].values and int(prod2) in test['productID'].values:
        all_members.append(x)
for x in all_members:
    print(x)

247
91
119
126
104
80
1
196
208
96
174
131
73
205
78
156
201
50
132
36

In [45]:
test

         timestamp  memberID  productID  productScore
96718   1307410185        36        217             5
96719   1307410189        36        248             2
96720   1307410197        36        241             4
96721   1307410202        36        190             3
96722   1307410213        36        203             3
...            ...       ...        ...           ...
108554  1421341776        36        217             5
108556  1421515557        36        325             4
108637  1421880705        36        132             3
108640  1422074496        36         78             5
108883  1424305194        36        227             4

[1447 rows x 4 columns]